-- 如下为电商公司用户访问时间数据
-- id		ts(秒)
-- 1001	17523641234
-- 1001	17523641256
-- 1002	17523641278
-- 1001	17523641334
-- 1002	17523641434
-- 1001	17523641534
-- 1001	17523641544
-- 1002	17523641634
-- 1001	17523641638
-- 1001	17523641654
-- 某个用户连续的访问记录如果时间间隔小于60秒，则分为同一个组，结果为：
-- id		ts(秒)			group
-- 1001	17523641234		1
-- 1001	17523641256		1
-- 1001	17523641334		2
-- 1001	17523641534		3
-- 1001	17523641544		3
-- 1001	17523641638		4
-- 1001	17523641654		4
-- 1002	17523641278		1
-- 1002	17523641434		2
-- 1002	17523641634		3

select
    id,ts,sum(c)over(partition by id order by ts) `group`
from (select id,
             ts,
             if(ts - shang >=60, 1, 0) c
      from (select id,
                   ts,
                   lag(ts, 1, 0) over (partition by id order by ts) shang
            from `table`) t1) t2
//总结 先与上一个通过条件判断得到1或0的一列 在窗口sum就得到不同的组id